In [1]:
import sys
print(sys.version)

3.13.5 | packaged by Anaconda, Inc. | (main, Jun 12 2025, 16:37:03) [MSC v.1929 64 bit (AMD64)]

In [ ]:
python.org ==> CPython - GIL is enabled   => pip install numpy pip install pandas ... ... ...

IPython - GIL is disabled 


In Python - Class and Object
            ================

Python native type/class - int float complex str bytes list tuple dict set

In [ ]:
i = 10 # initialization

10 - 0x1234
11 - 0x3452
12 - 0x3234

In [3]:
a = 10
b = 3+7
c = 2+8
print(hex(id(a)))
print(hex(id(b)))
print(hex(id(c)))
print(hex(id(10)))

0x7ffb5f4eb4c8
0x7ffb5f4eb4c8
0x7ffb5f4eb4c8
0x7ffb5f4eb4c8

In [ ]:
product 
   |->productID    - 101  - int
   |->productName  - 'pA'  - str
   |->productCost  - 1000.32 - float
   |->productStatus - True   - bool
    Vs
product_info1 = [101,'pA',1000.32,True] <== list - Collection of different types of items
                                       <== list - mutable(we can add/modify/delete)
    Vs
product_info2 = (101,'pA',1000.32,True) <== tuple - Collection of different types of items
                                             |__ immutable - we can't add/modify/delete 
    Vs
product_info3 = {'pid':101,'pname':'pA','pcost':1000.32,'pstatus':True} <== dict - Collection of different types of items
                                                                         |-- mutable (we can add/modify/delete)

In [ ]:
dict of list -> d={'Key1':[],'Key2':[],'Key3':[]} # 1Key ->Multiple values 
list of dict -> L=[{},{},{},{}] # index based

In [5]:
# How to add new data to an existing dict? 
# dictName['newKey'] = value

product_info1 = {} # empty dict

product_info1['pid'] = [101,102,103] 
product_info1['pname'] = ['pA','pB','pC']
product_info1['pcost'] = [1000,2000,3000]
print(product_info1)

{'pid': [101, 102, 103], 'pname': ['pA', 'pB', 'pC'], 'pcost': [1000, 2000, 3000]}

In [6]:
import pprint
pprint.pprint(product_info1)

{'pcost': [1000, 2000, 3000],
 'pid': [101, 102, 103],
 'pname': ['pA', 'pB', 'pC']}

In [7]:
# list of dict -> L=[{},{},{},{}] # index based 

product_info2 = [{'pid':101,'pname':'pA','pcost':1000},
                 {'pid':102,'pname':'pB','pcost':2000},
                 {'pid':103,'pname':'pC','pcost':3000}]

In [10]:
print(product_info2[0]['pname']) # list of dict
print(product_info1['pname'][0]) # dict of list

pA
pA

In [ ]:
numpy - Computation
  |-> index,slicing,reshaping
  |-> ufunctions

pandas - Analysis 
  |-> Series
  |-> DataFrame 

matplotlib - Visualization 
  |-> plot,scatter,bar,pie ...
|
EDA

In [11]:
L = [10,20,30,40,50]
L+100

TypeError: can only concatenate list (not "int") to list

In [15]:
import array
#help(array)
arr = array.array('i',[10,20,30,40,50])
L.append(4.5)
arr.append(55) # Vs arr.append(4.5)

In [16]:
arr

array('i', [10, 20, 30, 40, 50, 55])

In [17]:
import numpy
numpy.array(L)

array([10. , 20. , 30. , 40. , 50. ,  4.5,  4.5])

In [18]:
arr = numpy.array(L)
arr+100

array([110. , 120. , 130. , 140. , 150. , 104.5, 104.5])

In [20]:
arr = numpy.array(L)
print(arr.dtype)
print(arr.shape)
print(arr.ndim)

float64
(7,)
1

In [22]:
numpy.array([10,20.34,True,'data']).dtype

dtype('<U32')

In [23]:
numpy.array([10,20.34,True,'data']).ndim

1

In [26]:
print(numpy.array([[10,20.34,True,'data']]).ndim)
numpy.array([[10,20.34,True,'data']]).shape

2

(1, 4)

In [29]:
arr = numpy.array([[10,20.34,True,'data']])
print(arr[0][0])

10

In [30]:
arr+100

UFuncTypeError: ufunc 'add' did not contain a loop with signature matching types (dtype('<U32'), dtype('int64')) -> None

In [32]:
import numpy as np
arr = np.array([[10,20,30],[40,50,60]])
print(arr.ndim,arr.shape)
print(arr)

2 (2, 3)
[[10 20 30]
 [40 50 60]]

In [33]:
arr.reshape(2,3)

array([[10, 20, 30],
       [40, 50, 60]])

In [34]:
arr.reshape(-1,1)

array([[10],
       [20],
       [30],
       [40],
       [50],
       [60]])

In [35]:
np.array([1,2,3]).reshape(-1,1).ndim

2

In [ ]:
pandas
 |->Series
 |->DataFrame

In [38]:
import pandas
print(pandas.Series)
print(pandas.DataFrame)

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [ ]:
pandas/
     |__core/
           |__series.py
                 |--> class Series:
                            ...
     |__core/
           |__frame.py
                 |--> class DataFrame:
                             ...

In [39]:
import pandas as pd
pd.Series([10,20,30])

0    10
1    20
2    30
dtype: int64

In [40]:
pd.DataFrame([10,20,30])

    0
0  10
1  20
2  30

In [41]:
products = {}
products['pid'] = [101,102,103]
products['pname'] = ['pA','pB','pC']
products['pcost'] = [1000,2000,3000]
products

{'pid': [101, 102, 103],
 'pname': ['pA', 'pB', 'pC'],
 'pcost': [1000, 2000, 3000]}

In [42]:
pd.DataFrame(products)

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000

In [43]:
df1 = pd.DataFrame(products)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     3 non-null      int64
 1   pname   3 non-null      object
 2   pcost   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [44]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [45]:
df1.columns

Index(['pid', 'pname', 'pcost'], dtype='object')

In [46]:
len(df1.columns)

3

In [47]:
df1

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000

In [48]:
df1.loc[1] # row based access

pid       102
pname      pB
pcost    2000
Name: 1, dtype: object

In [49]:
df1['pname'] # column based access

0    pA
1    pB
2    pC
Name: pname, dtype: object

In [50]:
df1['pid']

0    101
1    102
2    103
Name: pid, dtype: int64

In [51]:
df1.loc[1]['pname'] # Row X Column ->data

'pB'

In [52]:
products = {}
products['pid'] = [101,102,103]
products['pname'] = ['pA','pB','pC']
products['pcost'] = [1000,2000,3000]

In [53]:
products['pid'].append(104)
products['pname'].append('pD')
products['pcost'].append(4000)

products['pid'].append(105)
products['pname'].append('pE')
products['pcost'].append(5000)

products['pid'].append(106)
products['pname'].append('pE')
products['pcost'].append(5000)
products

{'pid': [101, 102, 103, 104, 105, 106],
 'pname': ['pA', 'pB', 'pC', 'pD', 'pE', 'pE'],
 'pcost': [1000, 2000, 3000, 4000, 5000, 5000]}

In [54]:
df2 = pd.DataFrame(products)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pid     6 non-null      int64
 1   pname   6 non-null      object
 2   pcost   6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [55]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000
5  106    pE   5000

In [56]:
df2.loc[1]

pid       102
pname      pB
pcost    2000
Name: 1, dtype: object

In [57]:
df2.loc[2:] # from 2nd row to list of all - slicing

   pid pname  pcost
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000
5  106    pE   5000

In [58]:
df2.loc[2:4] # from 2nd row to 4th row

   pid pname  pcost
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000

In [59]:
df2.loc[2:4]['pname']

2    pC
3    pD
4    pE
Name: pname, dtype: object

In [60]:
df2.loc[2][['pname','pcost']]

pname      pC
pcost    3000
Name: 2, dtype: object

In [61]:
df2.loc[2:4][['pname','pcost']]

  pname  pcost
2    pC   3000
3    pD   4000
4    pE   5000

In [62]:

df2['pcost']

0    1000
1    2000
2    3000
3    4000
4    5000
5    5000
Name: pcost, dtype: int64

In [63]:
df2['pcost'] >2800

0    False
1    False
2     True
3     True
4     True
5     True
Name: pcost, dtype: bool

In [64]:
df2[df2['pcost'] >2800] # supports boolen index

   pid pname  pcost
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000
5  106    pE   5000

In [ ]:
# In pandas DF - mutable - inplace=True  <== modified input dataframe

In [65]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000
5  106    pE   5000

In [66]:
# To delete a particular row/record 
# df.drop(rowIndex)
df2.drop(3)

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
4  105    pE   5000
5  106    pE   5000

In [67]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000
5  106    pE   5000

In [68]:
df3 = df2.drop(3)
df3

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
4  105    pE   5000
5  106    pE   5000

In [69]:
df2

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000
5  106    pE   5000

In [70]:
df3.index

Index([0, 1, 2, 4, 5], dtype='int64')

In [71]:
df3.drop(4,inplace=True) # ->None but dataframe is updated

In [72]:
df3

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
5  106    pE   5000

In [73]:
# To drop columns
df3.drop(columns='pname')

   pid  pcost
0  101   1000
1  102   2000
2  103   3000
5  106   5000

In [74]:
df3

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
5  106    pE   5000

In [75]:
df3.drop(columns=['pname','pcost'])

   pid
0  101
1  102
2  103
5  106

In [76]:
df3

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
5  106    pE   5000

In [77]:
# rename columns
# -------------------
# {'oldColumnName':'newColumn'}

d={'K1':[1,2,3],'K2':[4,3,1],'Field 3':[10,23,34]}

df4 = pd.DataFrame(d)
df4.columns

Index(['K1', 'K2', 'Field 3'], dtype='object')

In [78]:
df4

   K1  K2  Field 3
0   1   4       10
1   2   3       23
2   3   1       34

In [79]:
df4.rename(columns={'Field 3':'K3'})

   K1  K2  K3
0   1   4  10
1   2   3  23
2   3   1  34

In [80]:
df4.rename(columns={'Field 3':'K3'},inplace=True)

In [81]:
df4.columns

Index(['K1', 'K2', 'K3'], dtype='object')

In [82]:
d={}
d['K1']=[10,20,None]
d['K2']=[15,None,None]
d['K3']=[None,11,None]
pd.DataFrame(d)

     K1    K2    K3
0  10.0  15.0   NaN
1  20.0   NaN  11.0
2   NaN   NaN   NaN

In [83]:
df5 = pd.DataFrame(d)
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   K1      2 non-null      float64
 1   K2      1 non-null      float64
 2   K3      1 non-null      float64
dtypes: float64(3)
memory usage: 204.0 bytes

In [84]:
df5.isnull()

      K1     K2     K3
0  False  False   True
1  False   True  False
2   True   True   True

In [85]:
df5.isnull().sum()

K1    1
K2    2
K3    2
dtype: int64

In [86]:
# To replace NaN value => fillna(<replacementValue>)

df5.fillna('Testdata')

         K1        K2        K3
0      10.0      15.0  Testdata
1      20.0  Testdata      11.0
2  Testdata  Testdata  Testdata

In [87]:
df5.fillna(45)

     K1    K2    K3
0  10.0  15.0  45.0
1  20.0  45.0  11.0
2  45.0  45.0  45.0

In [89]:
df5['K1']

0    10.0
1    20.0
2     NaN
Name: K1, dtype: float64

In [90]:
df5['K1'].fillna(45)

0    10.0
1    20.0
2    45.0
Name: K1, dtype: float64

In [91]:
df5[['K2','K3']].fillna(56.31)

      K2     K3
0  15.00  56.31
1  56.31  11.00
2  56.31  56.31

In [94]:
df5.fillna(56.31,inplace=True)

In [95]:
df5

      K1     K2     K3
0  10.00  15.00  56.31
1  20.00  56.31  11.00
2  56.31  56.31  56.31

In [96]:
df5.isnull().sum()

K1    0
K2    0
K3    0
dtype: int64

In [97]:
df5.duplicated()

0    False
1    False
2    False
dtype: bool

In [98]:
df5.duplicated().sum()

np.int64(0)

In [100]:
d={'K1':[10,10,30],'K2':[10,10,30],'K3':[10,10,30]}
df6 = pd.DataFrame(d)
df6.duplicated().sum()

np.int64(1)

In [102]:
df6.duplicated()

0    False
1     True
2    False
dtype: bool

In [103]:
df6

   K1  K2  K3
0  10  10  10
1  10  10  10
2  30  30  30

In [104]:
df6.drop_duplicates()

   K1  K2  K3
0  10  10  10
2  30  30  30

In [105]:
df6.drop_duplicates(inplace=True)

In [106]:
df6

   K1  K2  K3
0  10  10  10
2  30  30  30

In [108]:
d={'K1':[10,20,30],'K2':[15,None,None],'K3':[45,15,None],'K4':[11,12,13]}
df6 = pd.DataFrame(d)
print(df6)
df6.dropna()

   K1    K2    K3  K4
0  10  15.0  45.0  11
1  20   NaN  15.0  12
2  30   NaN   NaN  13

   K1    K2    K3  K4
0  10  15.0  45.0  11

In [110]:
df6.dropna(axis=1) # drop column with any NaN value

   K1  K4
0  10  11
1  20  12
2  30  13

In [112]:
# help(df6.dropna)

In [113]:
d={}
d['K1']=[10,20,30]
d['K2']=[15,None,None]
d['K3']=[45,11,None]
d['K4']=[1,2,3]
d['K5']=[10,None,None]
d

{'K1': [10, 20, 30],
 'K2': [15, None, None],
 'K3': [45, 11, None],
 'K4': [1, 2, 3],
 'K5': [10, None, None]}

In [114]:
df7 = pd.DataFrame(d)
df7.dropna(thresh=3)

   K1    K2    K3  K4    K5
0  10  15.0  45.0   1  10.0
1  20   NaN  11.0   2   NaN

In [115]:
df7.dropna(axis='columns',thresh=3)

   K1  K4
0  10   1
1  20   2
2  30   3

In [116]:
df1

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000

In [117]:
df1.loc[1]['pcost']

np.int64(2000)

In [ ]:
# To modify nth cell
# df.at[rowIndex,columnIndex] = updatedvalue ->None

In [118]:
df1

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000

In [119]:
df1.at[1,'pcost'] = 3489.31

C:\Users\karth\AppData\Local\Temp\ipykernel_29236\1321374637.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '3489.31' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df1.at[1,'pcost'] = 3489.31

In [120]:
df1

   pid pname    pcost
0  101    pA  1000.00
1  102    pB  3489.31
2  103    pC  3000.00

In [122]:
import numpy as np
np.array([[10,20,30,40],[50,60,70,80]]).shape

(2, 4)

In [129]:
arr = np.array([[10,20,30,40],[50,60,70,80]])
print(arr[0][3])

40

In [128]:
print(arr[0,3])

40

In [133]:
df6
df6.to_csv('r1.csv')

In [134]:
pd.read_csv('r1.csv')

   Unnamed: 0  K1    K2    K3  K4
0           0  10  15.0  45.0  11
1           1  20   NaN  15.0  12
2           2  30   NaN   NaN  13

In [135]:
df6.to_csv('r1.csv',index=False)
pd.read_csv('r1.csv')

   K1    K2    K3  K4
0  10  15.0  45.0  11
1  20   NaN  15.0  12
2  30   NaN   NaN  13

In [130]:
# pd.read_csv(<inputFile>) Vs pd.DataFrame(<DataStructure>) 

pd.read_csv('emp.csv')

   eid    ename  edept    ecity  ecost
0  101      raj  sales     pune   1000
1  102      leo   prod   bglore   2301
2  230      raj   prod     pune   2300
3  450     shan  sales   bglore   3401
4  542      anu     HR   mumbai   4590
5  321     bibu  sales      hyd   5419
6  651      ram     hr   bglore   3130
7  541      leo  admin  chennai   4913
8  652  karthik  sales   bglore   3405

In [131]:
df_csv = pd.read_csv('emp.csv')
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   ecity   9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

In [136]:
# 1. Load emp.csv file content to pandas ->df
df_csv = pd.read_csv('emp.csv')
# 2. get info about loaded DataFrame
df_csv.info()
# 3. List of row index and column index
print(df_csv.index)
print(df_csv.columns)
# 4. display shape of the data - Row X Col
print(df_csv.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eid     9 non-null      int64
 1   ename   9 non-null      object
 2   edept   9 non-null      object
 3   ecity   9 non-null      object
 4   ecost   9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes
RangeIndex(start=0, stop=9, step=1)
Index(['eid', 'ename', 'edept', 'ecity', 'ecost'], dtype='object')
(9, 5)

In [138]:
# 5. Test - any duplicated values are exists ->drop duplicated update to inputdataframe
df_csv.duplicated()
df_csv.duplicated().sum()
df_csv.drop_duplicates(inplace=True)

np.int64(0)

In [139]:
# 6. Test - any NaN values ->drop NaN index based and Column based
df_csv.isnull().sum()
# 7. Test - any NaN => replace NaN - row/column/ (or) global replacement
df_csv.dropna() # default rowbased
df_csv.dropna(axis=1) # columnbased
df_csv.fillna('sampledata') # global replacement
df_csv['edept'].fillna('Common_dept') # specific column based replacement

eid      0
ename    0
edept    0
ecity    0
ecost    0
dtype: int64

In [143]:
# 8. Rename some selective columns - modified input data frame
print(df_csv.columns)
df_csv.rename(columns={'edept':'EDEPT','ecost':'Amount'},inplace=True)
print(df_csv.columns)

Index(['eid', 'ename', 'edept', 'ecity', 'ecost'], dtype='object')
Index(['eid', 'ename', 'EDEPT', 'ecity', 'Amount'], dtype='object')

In [144]:
# 9. drop some selective columns
df_csv.drop(columns=['eid','ecity'])

     ename  EDEPT  Amount
0      raj  sales    1000
1      leo   prod    2301
2      raj   prod    2300
3     shan  sales    3401
4      anu     HR    4590
5     bibu  sales    5419
6      ram     hr    3130
7      leo  admin    4913
8  karthik  sales    3405

In [145]:
# 10. Write DataFrame ->external file
df_csv.to_csv('r1.csv',index=False)

In [146]:
pd.read_csv('r1.csv')

   eid    ename  EDEPT    ecity  Amount
0  101      raj  sales     pune    1000
1  102      leo   prod   bglore    2301
2  230      raj   prod     pune    2300
3  450     shan  sales   bglore    3401
4  542      anu     HR   mumbai    4590
5  321     bibu  sales      hyd    5419
6  651      ram     hr   bglore    3130
7  541      leo  admin  chennai    4913
8  652  karthik  sales   bglore    3405

In [148]:
len(df_csv.index)

9

In [152]:
for var in range(1,len(df_csv.index)+1):
    print(var,end=' ')

1 2 3 4 5 6 7 8 9

In [154]:
df_csv.index = [var for var in range(1,len(df_csv.index)+1)]

In [155]:
df_csv.index

Index([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [156]:
df_csv

   eid    ename  EDEPT    ecity  Amount
1  101      raj  sales     pune    1000
2  102      leo   prod   bglore    2301
3  230      raj   prod     pune    2300
4  450     shan  sales   bglore    3401
5  542      anu     HR   mumbai    4590
6  321     bibu  sales      hyd    5419
7  651      ram     hr   bglore    3130
8  541      leo  admin  chennai    4913
9  652  karthik  sales   bglore    3405

In [159]:
d={}

d['Tax'] = [var*0.18 if var > 2500 else var * 0.12 for var in df_csv['Amount']]
d['Tax']

[120.0,
 276.12,
 276.0,
 612.18,
 826.1999999999999,
 975.42,
 563.4,
 884.3399999999999,
 612.9]

In [160]:
df_csv.sort_index()

   eid    ename  EDEPT    ecity  Amount
1  101      raj  sales     pune    1000
2  102      leo   prod   bglore    2301
3  230      raj   prod     pune    2300
4  450     shan  sales   bglore    3401
5  542      anu     HR   mumbai    4590
6  321     bibu  sales      hyd    5419
7  651      ram     hr   bglore    3130
8  541      leo  admin  chennai    4913
9  652  karthik  sales   bglore    3405

In [161]:
df_csv.sort_index(ascending=False)

   eid    ename  EDEPT    ecity  Amount
9  652  karthik  sales   bglore    3405
8  541      leo  admin  chennai    4913
7  651      ram     hr   bglore    3130
6  321     bibu  sales      hyd    5419
5  542      anu     HR   mumbai    4590
4  450     shan  sales   bglore    3401
3  230      raj   prod     pune    2300
2  102      leo   prod   bglore    2301
1  101      raj  sales     pune    1000

In [162]:
df_csv.sort_values(by='ename')

   eid    ename  EDEPT    ecity  Amount
5  542      anu     HR   mumbai    4590
6  321     bibu  sales      hyd    5419
9  652  karthik  sales   bglore    3405
2  102      leo   prod   bglore    2301
8  541      leo  admin  chennai    4913
1  101      raj  sales     pune    1000
3  230      raj   prod     pune    2300
7  651      ram     hr   bglore    3130
4  450     shan  sales   bglore    3401

In [167]:
df_csv['EDEPT']
df_csv['EDEPT'] == 'sales'
df_csv[df_csv['EDEPT'] == 'sales'] # bool index

   eid    ename  EDEPT   ecity  Amount
1  101      raj  sales    pune    1000
4  450     shan  sales  bglore    3401
6  321     bibu  sales     hyd    5419
9  652  karthik  sales  bglore    3405

In [ ]:
Data Aggregation
------------------------
range of data//array ---->-- scalar data (single)
np.max([1,123,145,424345,34]) -> 424345 
       |___________________|     |____|
             //array              //scalar - Single

np.max()
np.min()
np.mean()
np.sum()
..
df.groupby('field').sum()|max()|min()|mean()|count()|...

In [169]:
products={'pnames':['pA','pB','pC','pD','pC','pA','pB'],
          'sales':[100,200,140,120,110,120,340]}

df = pd.DataFrame(products)
df.groupby('pnames').sum()

        sales
pnames
pA        220
pB        540
pC        250
pD        120

In [170]:
df.groupby('pnames').min()

        sales
pnames
pA        100
pB        200
pC        110
pD        120

In [171]:
df.groupby('pnames').max()

        sales
pnames
pA        120
pB        340
pC        140
pD        120

In [172]:
df.groupby('pnames').agg(['min','max'])

       sales
         min  max
pnames
pA       100  120
pB       200  340
pC       110  140
pD       120  120

In [167]:
df_csv['EDEPT']
df_csv['EDEPT'] == 'sales'
df_csv[df_csv['EDEPT'] == 'sales'] # bool index

   eid    ename  EDEPT   ecity  Amount
1  101      raj  sales    pune    1000
4  450     shan  sales  bglore    3401
6  321     bibu  sales     hyd    5419
9  652  karthik  sales  bglore    3405

In [179]:
df1_csv=pd.read_csv('emp.csv',index_col=2) # pd.read_csv('emp.csv',index_col='edept')
print(df1_csv.index)
print('')
df1_csv.loc['sales']

Index(['sales', 'prod', 'prod', 'sales', 'HR', 'sales', 'hr', 'admin',
       'sales'],
      dtype='object', name='edept')

       eid    ename   ecity  ecost
edept
sales  101      raj    pune   1000
sales  450     shan  bglore   3401
sales  321     bibu     hyd   5419
sales  652  karthik  bglore   3405

In [181]:
df1_csv.to_csv('r2.csv')

In [182]:
pd.read_csv('r2.csv')

   edept  eid    ename    ecity  ecost
0  sales  101      raj     pune   1000
1   prod  102      leo   bglore   2301
2   prod  230      raj     pune   2300
3  sales  450     shan   bglore   3401
4     HR  542      anu   mumbai   4590
5  sales  321     bibu      hyd   5419
6     hr  651      ram   bglore   3130
7  admin  541      leo  chennai   4913
8  sales  652  karthik   bglore   3405

In [183]:
df1_csv.to_csv('r1.log',sep=':')

In [184]:
pd.read_csv('r1.log')

     edept:eid:ename:ecity:ecost
0        sales:101:raj:pune:1000
1       prod:102:leo:bglore:2301
2         prod:230:raj:pune:2300
3     sales:450:shan:bglore:3401
4         HR:542:anu:mumbai:4590
5        sales:321:bibu:hyd:5419
6         hr:651:ram:bglore:3130
7     admin:541:leo:chennai:4913
8  sales:652:karthik:bglore:3405

In [185]:
pd.read_csv('r1.log',sep=":")

   edept  eid    ename    ecity  ecost
0  sales  101      raj     pune   1000
1   prod  102      leo   bglore   2301
2   prod  230      raj     pune   2300
3  sales  450     shan   bglore   3401
4     HR  542      anu   mumbai   4590
5  sales  321     bibu      hyd   5419
6     hr  651      ram   bglore   3130
7  admin  541      leo  chennai   4913
8  sales  652  karthik   bglore   3405

In [ ]:
pd.read_excel('inputFile.xlsx')
pd.read_excel('inputFile.xlsx',sheet_name='Sheet1')

In [ ]:
def fx(a):
    pass

df.apply(fx) 
df.apply(lambda ...)

In [187]:
#help(df_csv.apply)
# lambda => lambda <list of args>:<basicOperation> 
#                   ==============

In [ ]:
Python            <-----------DBModule---------->  DataBase
DS                                            SQL
'insert into .. values...' //str ------------->....
                                              select *from ...
  <-------------------------------list,tuple,list of tuple ...

In [188]:
import sqlite3
print(sqlite3.connect('test1.db'))

<sqlite3.Connection object at 0x000001E483B2B880>

In [191]:
conn = sqlite3.connect('test1.db')
sth = conn.cursor()
sth.execute('create table pn(id INTEGER,pname TEXT,pcost REAL)')

In [195]:
sth.execute("insert into pn(id,pname,pcost)values(101,'pA',1000)")
va = 102
vb = 'pB'
vc = 2000
sth.execute("insert into pn(id,pname,pcost)values(?,?,?)",(va,vb,vc))

In [196]:
sth.execute('select *from pn')

In [197]:
list(sth)

[(101, 'pA', 1000.0), (101, 'pA', 1000.0), (102, 'pB', 2000.0)]

In [198]:
sth.execute('select *from pn')
sth.fetchall()

[(101, 'pA', 1000.0), (101, 'pA', 1000.0), (102, 'pB', 2000.0)]

In [199]:
sth.execute('select *from pn')
sth.fetchone()

(101, 'pA', 1000.0)

In [200]:
sth.fetchone()

(101, 'pA', 1000.0)

In [201]:
sth.fetchone()

(102, 'pB', 2000.0)

In [202]:
sth.fetchone()

In [203]:
conn.commit()

In [204]:
conn.close()

In [205]:
conn = sqlite3.connect('test1.db')
sth = conn.cursor()
sth.execute("Select *from pn")
list(sth) # generator

[(101, 'pA', 1000.0), (101, 'pA', 1000.0), (102, 'pB', 2000.0)]

In [206]:
pd.read_sql_query("select *From pn",conn)

    id pname   pcost
0  101    pA  1000.0
1  101    pA  1000.0
2  102    pB  2000.0

In [207]:
df_sql = pd.read_sql_query("select *From pn",conn)
df_sql.to_csv('r1.csv',index=False)

In [208]:
pd.read_csv('r1.csv')

    id pname   pcost
0  101    pA  1000.0
1  101    pA  1000.0
2  102    pB  2000.0

In [ ]:
Extract-Transform-Load (ETL)
=============================
Data is Extracted from DataSource(File,API,DB,..) ==>Transformed(Clean;Aggregated) ==> Load 
Loaded to the target (Datawarehouse)

Extract-Load-Transformed (ELT)
=================================
Data is Extracted from DataSource(File,API,DB,..) ==>Loaded first into the target system -->transformed
inside the target

In [211]:
# Create products.csv file and write product details(pid,pname,pcost)
products = {}
products['pid']=[101,102,103,104,105]
products['pname']=['pA','pB','pC','pD','pE']
products['pcost']=[1000,2000,3000,4000,5000]

df_product = pd.DataFrame(products)
df_product.to_csv('products.csv')

In [ ]:
## Extract -->Transform -->Load 
## ---------------------------------
# products.csv  
# ---------------
# read the products.csv file # Extract
#  with.respect to product_cost apply tax value # Transform
#          --------------------------//df.apply(...) 
# load - create a new database file
# df.to_sql()

In [224]:
df_prod = pd.read_csv('products.csv') # Extract
df_prod.info()


## Transform
df_prod['pcost'] = df_prod.apply(lambda a: a['pcost'] * 12.0 if a['pname'] == 'pC' else a['pcost'],axis=1)
df_prod

## Load 
con = sqlite3.connect('product_etl.db')
df_prod.to_sql('product',con,if_exists='replace',index=False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5 non-null      int64
 1   pid         5 non-null      int64
 2   pname       5 non-null      object
 3   pcost       5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

5

In [225]:
# Testing
for var in con.execute('select *from product'):
    print(var)

(0, 101, 'pA', 1000.0)
(1, 102, 'pB', 2000.0)
(2, 103, 'pC', 36000.0)
(3, 104, 'pD', 4000.0)
(4, 105, 'pE', 5000.0)

In [226]:
con.close()

In [230]:
## ELT
## 1. Extract product.csv data from file
## 2. Load same product.csv data(raw data) 
## 3. Transform - use SQL query ..

df_prod = pd.read_csv('products.csv') # Extract
df_prod.drop(columns='Unnamed: 0',inplace=True)

Index(['pid', 'pname', 'pcost'], dtype='object')

In [231]:
df_prod

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000
3  104    pD   4000
4  105    pE   5000

In [232]:
# Load - Load raw data 
conn = sqlite3.connect('product_1.db')    
df_prod.to_sql('product_raw',conn,if_exists='replace',index=False)

5

In [236]:
## Transform (inside the db) - inside the DB via SQL not using python programming 
conn.execute("""create table product_final as 
                SELECT pid,
                       pname,
                       pcost,
                       CASE 
                         when pname == 'pC' THEN pcost * 18 
                         ELSE pcost 
                        END AS pcost
                       FROM product_raw;
                       """)
conn.commit()

In [237]:
for var in conn.execute('select *from product_final'):
    print(var)

(101, 'pA', 1000, 1000)
(102, 'pB', 2000, 2000)
(103, 'pC', 3000, 54000)
(104, 'pD', 4000, 4000)
(105, 'pE', 5000, 5000)

In [ ]:
JSON
-----
 |->Stores and exchange data - between web Applications

list <-->array
dict <--->object

In [241]:
import json
d={'K1':[10,20,30,40],'K2':{'K1':['URL1','URL2'],'K3':[True,False]}}
print(json.dumps(d,indent=2)) # from python -> convert to json

{
  "K1": [
    10,
    20,
    30,
    40
  ],
  "K2": {
    "K1": [
      "URL1",
      "URL2"
    ],
    "K3": [
      true,
      false
    ]
  }
}

In [242]:
json_data = json.dumps(d,indent=2)
json.loads(json_data) #  from json convert to python

{'K1': [10, 20, 30, 40], 'K2': {'K1': ['URL1', 'URL2'], 'K3': [True, False]}}

In [245]:
import json
products = {}
products['pid'] = [101,102,103]
products['pname'] = ['pA','pB','pC']
products['pcost'] = [1000,2000,3000]

df = pd.DataFrame(products)

df.to_json("product.json",indent=4)

In [247]:
## View - preview the data 
print(df.to_json(orient="records",indent=2)) # convert to json

[
  {
    "pid":101,
    "pname":"pA",
    "pcost":1000
  },
  {
    "pid":102,
    "pname":"pB",
    "pcost":2000
  },
  {
    "pid":103,
    "pname":"pC",
    "pcost":3000
  }
]

In [248]:
pd.read_json('product.json')

   pid pname  pcost
0  101    pA   1000
1  102    pB   2000
2  103    pC   3000

In [249]:
python_data = []

python_data.append({
    "login": "ggobi",
    "id": 423638,
    "node_id": "MDE"
  })
python_data.append({
    "login": "root",
    "id": 34223,
    "node_id": "ABC"
  })
python_data.append({
    "login": "userA",
    "id": 234423,
    "node_id": "IOR"
  })

In [250]:
python_data # list of dict

[{'login': 'ggobi', 'id': 423638, 'node_id': 'MDE'},
 {'login': 'root', 'id': 34223, 'node_id': 'ABC'},
 {'login': 'userA', 'id': 234423, 'node_id': 'IOR'}]

In [264]:
json_data = json.dumps(python_data) # convert to json 
##########

# 1. load json data into dataframe 
df = pd.DataFrame(python_data)

# 2. Transform - clean/modify/delete ..

print(df)
new_data = {'IOR':'V1','ABC':'V2','MDE':'V3'}
df['repo_data'] = df['node_id'].map(new_data)
df

   login      id node_id
0  ggobi  423638     MDE
1   root   34223     ABC
2  userA  234423     IOR

   login      id node_id repo_data
0  ggobi  423638     MDE        V3
1   root   34223     ABC        V2
2  userA  234423     IOR        V1

In [269]:
df = df[df['id'] >40000] # filter rows

In [270]:
df

   login      id node_id repo_data
0  ggobi  423638     MDE        V3
2  userA  234423     IOR        V1

In [271]:
## Save this updated_dataframe(transformed dataframe) to database 

conn = sqlite3.connect('test1.db')
cursor = conn.cursor()

cursor.execute('''
create table Tn(login TEXT,id INT,node_id TEXT,repo_data TEXT)''')

In [272]:
# load dataframe into sqlite table
df.to_sql("newTn",conn,if_exists="replace",index=False)

2

In [273]:
pd.read_sql_query("select *from newTn",conn)

   login      id node_id repo_data
0  ggobi  423638     MDE        V3
1  userA  234423     IOR        V1

In [ ]:
import requests
=================
download web content 
         ------------
          1. WebPage = <html> + data 
          2. Data only = json data - There is no html tag

Client ----------->Webserver ------->..... 
      ---------<--------------------------
              Content-Type:
                        1. Webpage
                        2. Application-data (or) Application-json data

Webscraping  - bs4 <== import bs4
- extract the data - ignore html tag

requests
===========
import requests   <===== (1)

requests.get('URL') -> r 
r.status_code -> 200 # OK  (2)

Get web header info  -> r.headers <== dict type <==(3)

r.text <== download the webcontent <== (4)

In [274]:
import requests

In [275]:
requests.get('https://www.google.com')

In [276]:
r = requests.get('https://www.google.com')
r.status_code

200

In [277]:
r.headers

{'Date': 'Mon, 06 Oct 2025 12:36:04 GMT', 'Expires': '-1', 'Cache-Control': 'private, max-age=0', 'Content-Type': 'text/html; charset=ISO-8859-1', 'Content-Security-Policy-Report-Only': "object-src 'none';base-uri 'self';script-src 'nonce-q4DyT49SAK1G9lTs2QQOIw' 'strict-dynamic' 'report-sample' 'unsafe-eval' 'unsafe-inline' https: http:;report-uri https://csp.withgoogle.com/csp/gws/other-hp", 'Accept-CH': 'Sec-CH-Prefers-Color-Scheme', 'P3P': 'CP="This is not a P3P policy! See g.co/p3phelp for more info."', 'Content-Encoding': 'gzip', 'Server': 'gws', 'X-XSS-Protection': '0', 'X-Frame-Options': 'SAMEORIGIN', 'Set-Cookie': 'AEC=AaJma5uesgF9-y193vrEa9EfkDqwd-BXopSmHLw8akWx7pBrP_4xPGet0g; expires=Sat, 04-Apr-2026 12:36:04 GMT; path=/; domain=.google.com; Secure; HttpOnly; SameSite=lax, NID=525=l3IhM8yYRxE7_Ox2vLowsQIj_OPB70lwogROM6nMrzTl5VLQp8ZWm8Qa8IYc-8mw1aId7KaBE9WxKlVh4UU2AOdW2dBqtt3SE9xpiEYr1jovpiZUoZjJAupLO1Hf2srozxFTzn2ymm_LaivZtsoXbwR0VzW-JNdo0QLIrp5La__x5LHHBIN-h76CDDfnDNRMMa9MaxIICghj3bYeNxI; expires=Tue, 07-Apr-2026 12:36:04 GMT; path=/; domain=.google.com; HttpOnly', 'Alt-Svc': 'h3=":443"; ma=2592000,h3-29=":443"; ma=2592000', 'Transfer-Encoding': 'chunked'}

In [278]:
google_page = r.text
print(type(google_page),len(google_page))

<class 'str'> 19249

In [279]:
with open('test.html','w') as wobj:
    wobj.write(google_page)

In [282]:
r = requests.get('https://api.github.com/users/hadley/orgs')
print(r.status_code)
print(r.headers)

200
{'Date': 'Mon, 06 Oct 2025 12:39:28 GMT', 'Content-Type': 'application/json; charset=utf-8', 'Cache-Control': 'public, max-age=60, s-maxage=60', 'Vary': 'Accept,Accept-Encoding, Accept, X-Requested-With', 'ETag': 'W/"61f25e2a55611f7eaf75a20ed5fe501245c5af99bc383854f5442975318fad26"', 'X-GitHub-Media-Type': 'github.v3; format=json', 'x-github-api-version-selected': '2022-11-28', 'Access-Control-Expose-Headers': 'ETag, Link, Location, Retry-After, X-GitHub-OTP, X-RateLimit-Limit, X-RateLimit-Remaining, X-RateLimit-Used, X-RateLimit-Resource, X-RateLimit-Reset, X-OAuth-Scopes, X-Accepted-OAuth-Scopes, X-Poll-Interval, X-GitHub-Media-Type, X-GitHub-SSO, X-GitHub-Request-Id, Deprecation, Sunset', 'Access-Control-Allow-Origin': '*', 'Strict-Transport-Security': 'max-age=31536000; includeSubdomains; preload', 'X-Frame-Options': 'deny', 'X-Content-Type-Options': 'nosniff', 'X-XSS-Protection': '0', 'Referrer-Policy': 'origin-when-cross-origin, strict-origin-when-cross-origin', 'Content-Security-Policy': "default-src 'none'", 'Content-Encoding': 'gzip', 'Server': 'github.com', 'Accept-Ranges': 'bytes', 'X-RateLimit-Limit': '60', 'X-RateLimit-Remaining': '57', 'X-RateLimit-Reset': '1759755895', 'X-RateLimit-Resource': 'core', 'X-RateLimit-Used': '3', 'Content-Length': '1008', 'X-GitHub-Request-Id': '13CC:2C9748:12048D3:17482C5:68E3B889'}

In [283]:
json_data  = r.text

In [ ]:
## bs4 module
1. import bs4 module
2. bs4.BeautifulSoup - class name - constructor - argument is webpage 
3. soupObject.<htmlTag> ->Value 
     <or>
   soupObject.find(<htmlTag>) ->Value
      <or>
   soupObject.find_all(<htmlTag>) -> [ ]

bs4 - dict style 

<a class='id-1' href='url' var = value>
   ============ =========  ============//dict 

Tree structure relation
-------------------------
  Parent - Child 
  Sibiling 
     |
extracted data => dict of list  
                  ============= - easy to convert to DataFrame ->data analysis/processing....

In [284]:
import bs4

In [285]:
soup_obj = bs4.BeautifulSoup(google_page)
soup_obj.title

In [286]:
soup_obj.p

In [288]:
#soup_obj.head
soup_obj.h1

In [289]:
soup_obj.find('title') # same as soup_obj.title

In [290]:
soup_obj.find('p')

In [291]:
soup_obj.find_all('p')

In [296]:
d={'K1':'V1'}
# d.get('Kx') # d['Kx']
# =====================
soup_obj.find('p').get('style')

'font-size:8pt;color:#636363'

In [298]:
# soup_obj.title.parent
soup_obj.p.parent

<span id="footer"><div style="font-size:10pt"><div id="WqQANb" style="margin:19px auto;text-align:center"><a href="/intl/en/ads/">Advertising</a><a href="http://www.google.co.in/services/">Business Solutions</a><a href="/intl/en/about.html">About Google</a><a href="https://www.google.com/setprefdomain?prefdom=IN&amp;prev=https://www.google.co.in/&amp;sig=K_A538fZvgJi_XjNpP517LCiesWZ4%3D">Google.co.in</a></div></div><p style="font-size:8pt;color:#636363">© 2025 - <a href="/intl/en/policies/privacy/">Privacy</a> - <a href="/intl/en/policies/terms/">Terms</a></p></span>

In [299]:
soup_obj.p.children

In [300]:
list(soup_obj.p.children)

['© 2025 - ',
 <a href="/intl/en/policies/privacy/">Privacy</a>,
 ' - ',
 <a href="/intl/en/policies/terms/">Terms</a>]

In [302]:
for var in soup_obj.find_all('a'):
    print(var.get('href'))

https://www.google.com/imghp?hl=en&tab=wi
https://maps.google.co.in/maps?hl=en&tab=wl
https://play.google.com/?hl=en&tab=w8
https://www.youtube.com/?tab=w1
https://news.google.com/?tab=wn
https://mail.google.com/mail/?tab=wm
https://drive.google.com/?tab=wo
https://www.google.co.in/intl/en/about/products?tab=wh
http://www.google.co.in/history/optout?hl=en
/preferences?hl=en
https://accounts.google.com/ServiceLogin?hl=en&passive=true&continue=https://www.google.com/&ec=GAZAAQ
/advanced_search?hl=en-IN&authuser=0
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=hi&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAY
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=bn&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAc
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=te&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAg
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=mr&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAk
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=ta&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAo
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=gu&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAs
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=kn&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAw
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=ml&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCA0
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=pa&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCA4
/intl/en/ads/
http://www.google.co.in/services/
/intl/en/about.html
https://www.google.com/setprefdomain?prefdom=IN&prev=https://www.google.co.in/&sig=K_A538fZvgJi_XjNpP517LCiesWZ4%3D
/intl/en/policies/privacy/
/intl/en/policies/terms/

In [307]:
soup_obj.title

In [308]:
soup_obj.title.contents

['Google']

In [310]:
for var in soup_obj.find_all('a'):
    print(var.contents)

['Images']
['Maps']
['Play']
['YouTube']
['News']
['Gmail']
['Drive']
[<u>More</u>, ' »']
['Web History']
['Settings']
['Sign in']
['Advanced search']
['हिन्दी']
['বাংলা']
['తెలుగు']
['मराठी']
['தமிழ்']
['ગુજરાતી']
['ಕನ್ನಡ']
['മലയാളം']
['ਪੰਜਾਬੀ']
['Advertising']
['Business Solutions']
['About Google']
['Google.co.in']
['Privacy']
['Terms']

In [311]:
import re
re.search('^https','www.https.abc')

In [312]:
re.search('^https','https.abc')

In [314]:
for var in soup_obj.find_all('a'):
    if(re.search('^http',var.get('href'))): # print(var.get('href'))
        print(var.get('href'))

https://www.google.com/imghp?hl=en&tab=wi
https://maps.google.co.in/maps?hl=en&tab=wl
https://play.google.com/?hl=en&tab=w8
https://www.youtube.com/?tab=w1
https://news.google.com/?tab=wn
https://mail.google.com/mail/?tab=wm
https://drive.google.com/?tab=wo
https://www.google.co.in/intl/en/about/products?tab=wh
http://www.google.co.in/history/optout?hl=en
https://accounts.google.com/ServiceLogin?hl=en&passive=true&continue=https://www.google.com/&ec=GAZAAQ
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=hi&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAY
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=bn&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAc
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=te&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAg
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=mr&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAk
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=ta&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAo
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=gu&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAs
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=kn&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAw
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=ml&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCA0
https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=pa&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCA4
http://www.google.co.in/services/
https://www.google.com/setprefdomain?prefdom=IN&prev=https://www.google.co.in/&sig=K_A538fZvgJi_XjNpP517LCiesWZ4%3D

In [315]:
URLs = []
for var in soup_obj.find_all('a'):
    if(re.search('^http',var.get('href'))): # print(var.get('href'))
        URLs.append(var.get('href'))
        #print(var.get('href'))

In [316]:
d={}
d['Google'] = URLs
d

{'Google': ['https://www.google.com/imghp?hl=en&tab=wi',
  'https://maps.google.co.in/maps?hl=en&tab=wl',
  'https://play.google.com/?hl=en&tab=w8',
  'https://www.youtube.com/?tab=w1',
  'https://news.google.com/?tab=wn',
  'https://mail.google.com/mail/?tab=wm',
  'https://drive.google.com/?tab=wo',
  'https://www.google.co.in/intl/en/about/products?tab=wh',
  'http://www.google.co.in/history/optout?hl=en',
  'https://accounts.google.com/ServiceLogin?hl=en&passive=true&continue=https://www.google.com/&ec=GAZAAQ',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=hi&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAY',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=bn&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAc',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=te&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAg',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=mr&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAk',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=ta&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAo',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=gu&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAs',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=kn&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCAw',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=ml&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCA0',
  'https://www.google.com/setprefs?sig=0_ejZoqY7kz4Ka0FSrnCuQOlZ1XuM%3D&hl=pa&source=homepage&sa=X&ved=0ahUKEwjrsvmOy4-QAxWhBbkGHc--C-0Q2ZgBCA4',
  'http://www.google.co.in/services/',
  'https://www.google.com/setprefdomain?prefdom=IN&prev=https://www.google.co.in/&sig=K_A538fZvgJi_XjNpP517LCiesWZ4%3D']}

In [317]:
pd.DataFrame(d)

                                               Google
0           https://www.google.com/imghp?hl=en&tab=wi
1         https://maps.google.co.in/maps?hl=en&tab=wl
2               https://play.google.com/?hl=en&tab=w8
3                     https://www.youtube.com/?tab=w1
4                     https://news.google.com/?tab=wn
5                https://mail.google.com/mail/?tab=wm
6                    https://drive.google.com/?tab=wo
7   https://www.google.co.in/intl/en/about/product...
8        http://www.google.co.in/history/optout?hl=en
9   https://accounts.google.com/ServiceLogin?hl=en...
10  https://www.google.com/setprefs?sig=0_ejZoqY7k...
11  https://www.google.com/setprefs?sig=0_ejZoqY7k...
12  https://www.google.com/setprefs?sig=0_ejZoqY7k...
13  https://www.google.com/setprefs?sig=0_ejZoqY7k...
14  https://www.google.com/setprefs?sig=0_ejZoqY7k...
15  https://www.google.com/setprefs?sig=0_ejZoqY7k...
16  https://www.google.com/setprefs?sig=0_ejZoqY7k...
17  https://www.google.com/setprefs?sig=0_ejZoqY7k...
18  https://www.google.com/setprefs?sig=0_ejZoqY7k...
19                  http://www.google.co.in/services/
20  https://www.google.com/setprefdomain?prefdom=I...

In [ ]:
#################   End of the Day1 #################